read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/qflow/tech/OpenRule1um/OpenRule1um_stdcells.lib
read_verilog  /mnt/c/Users/seijirom/work/FullAdder_or1u/source/fa.v

# High-level synthesis
synth -top fa
# Map register flops
dfflibmap -liberty /usr/local/share/qflow/tech/OpenRule1um/OpenRule1um_stdcells.lib
opt

# Map combinatorial cells, standard script
abc -exe /usr/local/share/qflow/bin/yosys-abc -liberty /usr/local/share/qflow/tech/OpenRule1um/OpenRule1um_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten

clean -purge
# Output buffering
iopadmap -outpad BUFX2 A:Y -bits
# Cleanup
opt
clean
rename -enumerate
write_blif  -buf BUFX2 A Y fa_mapped.blif
